/**
 * Знакомство с веб-сайтом, где вы сможете найти документацию Kotlin и другие полезные материалы, необходимые для освоения языка. Объяснение структуры веб-сайта и помощь в использовании, чтобы более уверенно владеть этим современным и многоплатформенным языком программирования.
 *
 * Официальная документация: https://kotlinlang.org/docs/home.html
 *
 * Некоторые разделы:
 *
 * - Обзор Kotlin (https://kotlinlang.org/docs/multiplatform.html).
 * Язык имеет широкий спектр применения, и здесь вы можете узнать о его использовании в разных областях. Прочтите о фреймворках, с которыми он работает, изучите примеры проектов и пройдите учебные пособия, узнайте об официальных библиотеках (https://kotlinlang.org/docs/coroutines-guide.html) и т.д.
 *
 * - Новости Kotlin (https://blog.jetbrains.com/kotlin/).
 * Блог Kotlin предоставляет информацию о развитии языка и его использовании. Здесь вы можете найти статьи о новых релизах, вебинары с экспертами, различные практические руководства по использованию Kotlin с разными фреймворками, библиотеками, инструментами и многое другое.
 *
 * - Сообщество Kotlin (https://kotlinlang.org/community/).
 * Если вы активный пользователь и хотите принять участие в сообществе, у вас есть несколько вариантов.
 * Группы пользователей Kotlin (https://kotlinlang.org/user-groups/user-group-list.html) работают по всему миру в разных городах. Если такой есть в вашем городе, вы можете присоединиться к его встречам; в противном случае вы можете подписаться на группу виртуальных пользователей Kotlin (https://www.meetup.com/Virtual-Kotlin-User-Group/).
 * Другие онлайн-платформы включают канал Slack (https://kotlinlang.slack.com/), группу Linkedin (https://www.linkedin.com/groups/7417237/) и форум Kotlin (https://discuss.kotlinlang.org/), где вы можете встречаться и общаться с разработчиками Kotlin со всего мира.
 * Приглашаются также желающие внести свой вклад в развитие языка. На странице «Вклад» (https://kotlinlang.org/docs/contribute.html) вы узнаете, какие возможности у вас есть, и выберите вариант, наиболее соответствующий вашим интересам. Если вы начинающий специалист и не готовы вносить свой вклад в сам язык из-за отсутствия опыта, вы всё равно можете внести свой вклад в документацию. Наконец, если вы обнаружили какую-то ошибку, вы можете открыть заявку в системе отслеживания проблем и проследить за её решением.
 *
 * - Практика.
 * Изучать программирование очень сложно, и практика играет важную роль в этом процессе. Сайт позволяет изучить Kotlin на собственном примере. В этом разделе (https://play.kotlinlang.org/byExample/overview) вы найдете примеры, иллюстрирующие различные возможности языка. Более того, вы можете пойти дальше и решить коаны Kotlin (https://play.kotlinlang.org/koans/overview) — серию упражнений, призванных помочь вам попрактиковаться в синтаксисе Kotlin.
 *
 *
 * Kotlin Standard Library
 *
 * Kotlin реализует множество расширений для классов JDK, а также утилит, которые улучшают нашу работу со строками, коллекциями, потоками и т.д.
 *
 * Они входят в стандартную библиотеку Kotlin (stdlib) и доступны по ссылке https://kotlinlang.org/api/latest/jvm/stdlib/.
 *
 *
 * Exploring packages
 *
 * Давайте обратимся к документации класса Int (https://kotlinlang.org/api/latest/jvm/stdlib/kotlin/-int/inc.html) и посмотрим, что она может нам рассказать о функции inc(). В самом верху находится блок, где мы видим, что начиная с версии языка 1.6 функция доступна для всех вышеперечисленных платформ.
 */
