/**
 * Интерфейс — это набор методов, описывающих поведение объекта. Для реализации интерфейса объект должен реализовать все методы из него. Поведение объекта жёсткое и не может измениться во время выполнения программы.
 *
 * Обычно мы используем глаголы для имён методов и существительные или прилагательные для имён интерфейсов.
 *
 * Один метод соответствует только одному навыку объекта, но во многих ситуациях этого достаточно, чтобы сделать интерфейс эффективным.
 *
 * Если не разбивать интерфейсы с большим количеством обязанностей на более мелкие, код запутается, и ни вы, ни другие разработчики его не поймёте.
 */
fun main() {}
